export default {
    options: [
        {
            value: '',
            label: '不限'
        },
        {
            value: '社会扶贫',
            label: '社会扶贫',
            // children: [
            //     {
            //         value: '定点扶贫',
            //         label: '定点扶贫'
            //     },
            //     {
            //         value: '东西协作',
            //         label: '东西协作'
            //     },
            //     {
            //         value: '社会组织扶贫',
            //         label: '社会组织扶贫'
            //     },
            //     {
            //         value: '国际交流合作',
            //         label: '国际交流合作'
            //     }
            // ]
        },
        {
            value: '社会保障扶贫',
            label: '社会保障扶贫',
            // children: [
            //     {
            //         value: '医疗卫生扶贫',
            //         label: '医疗卫生扶贫'
            //     },
            //     {
            //         value: '保险扶贫',
            //         label: '保险扶贫'
            //     },
            //     {
            //         value: '计划生育和人口服务管理',
            //         label: '计划生育和人口服务管理'
            //     },
            //     {
            //         value: '社会保障制度',
            //         label: '社会保障制度'
            //     },
            //     {
            //         value: '重点群体',
            //         label: '重点群体'
            //     }
            // ]
        },
        {
            value: '教育扶贫',
            label: '教育扶贫',
            // children: [
            //     {
            //         value: '教育资金',
            //         label: '教育资金'
            //     },
            //     {
            //         value: '职业培训',
            //         label: '职业培训'
            //     },
            //     {
            //         value: '基础教育扶贫',
            //         label: '基础教育扶贫'
            //     },
            //     {
            //         value: '就业扶贫',
            //         label: '就业扶贫'
            //     },
            //     {
            //         value: '高等教育服务',
            //         label: '高等教育服务'
            //     }
            // ]
        },
        {
            value: '生态能源扶贫',
            label: '生态能源扶贫',
            // children: [
            //     {
            //         value: '能源扶贫',
            //         label: '能源扶贫'
            //     },
            //     {
            //         value: '生态环境建设',
            //         label: '生态环境建设'
            //     }
            // ]
        },
        {
            value: '产业扶贫',
            label: '产业扶贫',
            // children: [
            //     {
            //         value: '科技产业扶贫',
            //         label: '科技产业扶贫'
            //     },
            //     {
            //         value: '农林产业扶贫',
            //         label: '农林产业扶贫'
            //     },
            //     {
            //         value: '旅游产业扶贫',
            //         label: '旅游产业扶贫'
            //     },
            //     {
            //         value: '其他产业扶贫',
            //         label: '其他产业扶贫'
            //     },
            //     {
            //         value: '特色产业扶贫',
            //         label: '特色产业扶贫'
            //     }
            // ]
        },
        {
            value: '政策保障扶贫',
            label: '政策保障扶贫',
            // children: [
            //     {
            //         value: '金融财政政策',
            //         label: '金融财政政策'
            //     },
            //     {
            //         value: '投资政策',
            //         label: '投资政策'
            //     },
            //     {
            //         value: '土地政策',
            //         label: '土地政策'
            //     },
            //     {
            //         value: '干部人才政策',
            //         label: '干部人才政策'
            //     },
            //     {
            //         value: '考核督查问责',
            //         label: '考核督查问责'
            //     }
            // ]
        },
        {
            value: '基础建设扶贫',
            label: '基础建设扶贫',
            // children: [
            //     {
            //         value: '异地搬迁扶贫',
            //         label: '异地搬迁扶贫'
            //     },
            //     {
            //         value: '基础设施建设扶贫',
            //         label: '基础设施建设扶贫'
            //     },
            //     {
            //         value: '人居环境',
            //         label: '人居环境'
            //     },
            //     {
            //         value: '整村推进',
            //         label: '整村推进'
            //     },
            //     {
            //         value: '通信网络',
            //         label: '通信网络'
            //     }
            // ]
        },
        {
            value: '电商扶贫',
            label: '电商扶贫'
        }
    ]
}